app/views/comments/_form.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
---
<h3>Post a Comment (<%= @article.comments.size %>)</h3>