app/controllers/articles_controller.rb

  def create
  	@article = Article.new(article_params)
  	@article.save
---
INSERT INTO "articles" ("title", "body", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
  	@article = Article.find(params[:id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 4]]

  def update
  	@article = Article.find(params[:id])
  	@article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "articles" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "CCC"], ["body", "CCCC"], ["updated_at", "2016-03-29 18:22:37.350886"], ["id", 7]]