app/controllers/authors_controller.rb

  def update
    respond_to do |format|
      if @author.update(author_params)
---
UPDATE "authors" SET "salt" = ?, "crypted_password" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["salt", "dutT8JsFtxyjqtyK3LiH"], ["crypted_password", "$2a$10$Fw9gytDntLYGIwbwHJDro.Bp37VmklYPTgSjPRPNjwxpHKbeWk1tS"], ["updated_at", "2016-03-30 01:36:09.129741"], ["id", 1]]