app/controllers/tags_controller.rb

  def create
  	@tag = Tag.new(tag_params)
  	@tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "new_tag"], ["created_at", "2016-03-29 21:33:50.879913"], ["updated_at", "2016-03-29 21:33:50.879913"]]

	def destroy
		@tag = Tag.find(params[:id]).destroy
---
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 1]]